app/controllers/landscapes_controller.rb

SELECT * FROM "landscapes" LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
---
  def index
    @landscape = Landscape.first
    @note = current_user.notes.build
    user = User.find(params[:user]) if params[:user]