app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
---
  def show
    @user = params[:id] ? User.find(params[:id]) : @current_user

UPDATE "users" SET "perishable_token" = 'G0lARxS9k43YxeMe99rA', "player_name" = 'Barouf', "updated_at" = '2010-01-17 11:38:05' WHERE "id" = 1
---
  def update
    if @user.update_attributes(params[:user])